# ნაწილი 1 – თეორია (10 ქულა)

# 1. (2 ქულა) რა იქნება შედეგი?

# x = 7
# y = 3
# print(x % y)

# ა) 2
# ბ) 1
# გ) 0
# დ) 3

# 2. (2 ქულა) რას აბრუნებს ეს კოდი?

# nums = [10, 20, 30, 40]
# print(nums[2])

# 3. (2 ქულა) რა განსხვავებაა == და = შორის?

# 4. (2 ქულა) როდის ვიყენებთ while ციკლს?

# 5. (2 ქულა) რა იქნება შედეგი?

# x = 5
# if x > 3 and x < 10:
#     print("Hello")
# else:
#     print("Bye")
# ნაწილი 2 – კოდის კითხვა (10 ქულა)

# 6. (2 ქულა) რას დაბეჭდავს კოდი?

# for i in range(3):
#     print(i)

# 7. (2 ქულა) რას დაბეჭდავს?

# numbers = [1, 2, 3]
# for n in numbers:
#     print(n * 2)

# 8. (3 ქულა) იპოვე შეცდომა (დებაგინგი):

# age = 18
# if age => 18:
#     print("Adult")

# რა არის შეცდომა და როგორ გასწორდება?

# 9. (3 ქულა) რას დაბეჭდავს?

# i = 0
# while i < 3:
#     print(i)
#     i += 1
# ნაწილი 3 – პრაქტიკული დავალებები (10 ქულა)

# 10. (3 ქულა) დაწერე პროგრამა, რომელიც:

# შექმნის ლისტს [5, 10, 15, 20]

# დაბეჭდავს ყველა ელემენტს for ციკლით

# 11. (3 ქულა) დაწერე პროგრამა, რომელიც:

# მომხმარებელს შეეკითხება რიცხვს

# თუ რიცხვი ლუწია დაბეჭდოს "Even"

# თუ კენტი — "Odd"

# 12. (4 ქულა) დაწერე პროგრამა, რომელიც:

# შექმნის ლისტს [2, 4, 6, 8, 10]

# while ციკლით დაითვლის ჯამს

# დაბეჭდავს ჯამს

# 📊 ქულების სისტემა

# 25–30 ქულა → ⭐ ძალიან კარგი

# 18–24 ქულა → 👍 კარგი

# 10–17 ქულა → 📘 საშუალო

# 0–9 ქულა → საჭიროა გამეორება
# 1
1
# # 2
# 30-ს
# # 3
# == არის უდრის და = გამოიყენება მაშინ როცა გვინდა ცვლად შევქმნათ
# # 4 
# while-არის  სანამ და ჩვენ ვიყენებთ მას როცა გვინდა რომ რაღაც მოქმედება გამეორდეს 
# 5 ეს კოდი გამოიტანს hello-ს
# 6: 0,1,2
# 7 : 2,4,6
# 8:if age => 18: უნდა იყოს if age >= 18:
# 9: 0,1,2
# 10
lst=[5, 10, 15, 20]
for i in lst:
    print(i)
# 11
a=int(input("sheiyvane ricxvi: "))
if a%2==0:
    print("even")
else:
    print("odd")
# 12
num=[2, 4, 6, 8, 10]
b=0
i=0
while i < len(num):
    b=b+num[i]
    i=i+1
print(b)

    