# რა განსხვავებაა for და while ციკლებს შორის?,
# როდის გამოიყენებ if, elif, else-ს?,
# რას დააბრუნებს ეს კოდი?,

# numbers = [2, 4, 6]
# for n in numbers:
#     print(n + 1)



#  ნაწილი 2 – პრაქტიკული (25 ქულა)

#  1) for loop (5 ქულა)

# დაწერე პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 20-მდე.

# ⸻

#  2) while loop (5 ქულა)

# დაწერე პროგრამა, რომელიც დაბეჭდავს 10-დან 1-მდე რიცხვებს (კლებადობით).

# ⸻

#  3) if / else (5 ქულა)

# მომხმარებელს შემოატანინე რიცხვი და:
#     •    თუ ლუწია → დაბეჭდე "Even"
#     •    თუ კენტია → დაბეჭდე "Odd"

# ⸻

#  4) List + for (5 ქულა)

# მოცემულია სია:

# numbers = [5, 12, 7, 20, 3]
# დაბეჭდე მხოლოდ ის რიცხვები, რომლებიც 10-ზე დიდია.






#  5) პატარა კომბინირებული დავალება (5 ქულა)

# დაწერე პროგრამა რომელიც:
#     •    შექმნის სიას [1,2,3,4,5,6,7,8,9,10]
#     •    for ციკლით დაითვლის რამდენი ლუწი რიცხვია სიაში
#     •    დაბეჭდავს შედეგს

# მაგალითი Output:
# Even numbers: 5



# for-ი არის key word რომელის გამიყენების დროს ხდება განმეორება მოქმედების და while-ი არის ციკლი რომელიც მეორდება სანამ დებულება არ იქნება true
# if-ი გამოიყენება როცა გვინდა შევამოწმოთ პირობა და els-ი გამოიყენება მაშინ როცა პირობას არ უდრის if-ს 
# # numbers = [2, 4, 6]
# for n in numbers:
    # print(n + 1) ეს კოდი დააბრუნებს 3,5,7
# 1
 for i in range(20):
      print(i+1)
# 2
i=10
while i>0:
    print(i)
    i=i-1

# 3
a=int(input("sheiyvane ricxvi: "))
if a%2==0:
    print("even")
else:
    print("odd")
# 4
number=[5,12,7,20,3]
for i in number:
   if i>10:
       print(i)

# 5
num=[1,2,3,4,5,6,7,8,9,10]
for i in num:
    if i%2==0:
        print(i)
    