# 1️⃣ for loop

# დაწერე პროგრამა, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე.

# 2️⃣ while loop

# დაწერე პროგრამა, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე (უკუღმა).

# 3️⃣ if-else

# მომხმარებელს შემოატანინე ერთი რიცხვი და შეამოწმე:

# თუ რიცხვი ლუწია — დაბეჭდე "ლუწი"

# სხვა შემთხვევაში — დაბეჭდე "კენტი"

# 4️⃣ for + if-else ერთად

# დაწერე პროგრამა, რომელიც 1-დან 20-მდე რიცხვებს გადაუვლის for ციკლით და:

# თუ რიცხვი 3-ზე იყოფა — დაბეჭდოს "იყოფა 3-ზე"

# სხვა შემთხვევაში — დაბეჭდოს თავად რიცხვი
# 1
for i in range(1,11):
 print(i)
# 2
num=10
while num>0:
 print(num)
 num=num-1
# 3 
a=int(input("sheiyvaen ricxvi: "))
if a%2==0:
 print("ლუწი")
else:
 print("კენტი")
#  4
number=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
for i in number:
 if i%3==0:
  print("iyofa 3-ze")
 else:
  print(i)